const chartPoll = document.getElementById('myChart');
Chart.defaults.font.size = 14;
const myChart = new Chart(chartPoll, {
    type: 'bar',
    data: {
        labels: 
        [['#1 พ.ท.(หญิง) ฐิฎา','รังสิตพล มานิตกุล'],
         ['#2 พ.ท.(หญิง) ฐิฎา','รังสิตพล มานิตกุล'],
         ['เบอร์ 3'],
         ['เบอร์ 4'],
         ['เบอร์ 5'],
         ['เบอร์ 6'],
         ['เบอร์ 7'],
         ['เบอร์ 8'],
         ['เบอร์ 9'],
         ['เบอร์ 10'],
         ['เบอร์ 11'],
         ['เบอร์ 12'],
         ['เบอร์ 13'],
         ['เบอร์ 14'],
         ['เบอร์ 15'],
         ['เบอร์ 16'],
         ['เบอร์ 17'],
         ['เบอร์ 18'],
         ['เบอร์ 19'],
         ['เบอร์ 20'],
         ['เบอร์ 21'],
         ['เบอร์ 22'],
         ['เบอร์ 23'],
         ['เบอร์ 24'],
         ['เบอร์ 25'],
         ['เบอร์ 26'],
         ['เบอร์ 27'],
         ['เบอร์ 28'],
         ['เบอร์ 29'],
         ['เบอร์ 30'],
         ['เบอร์ 31'],
        ],
        datasets: [{
            data: [
                12, 
                19, 
                3, 
                5, 
                2, 
                3, 
                11,
                12, 
                19, 
                3, 
                5, 
                2, 
                3, 
                11,
                12, 
                19, 
                3, 
                5, 
                2, 
                3, 
                11,
                12, 
                19, 
                3, 
                5, 
                2, 
                3, 
                11,
                15,
                8,
                9,

            ],
            backgroundColor: [
                'rgba(0, 105, 255, 0.8)',
                'rgba(255, 99, 132, 0.8)',
                'rgba(153, 102, 255, 0.8)',
                'rgba(75, 192, 192, 0.8)',
                'rgba(54, 162, 235, 0.8)',
                'rgba(85, 85, 85, 0.8)',
                'rgba(223, 143, 0, 0.8)'
            ],
            borderColor: [
                'rgba(0, 105, 255, 1)',
                'rgba(255, 99, 132, 1)',
                'rgba(153, 102, 255, 1)',
                'rgba(75, 192, 192, 1)',
                'rgba(54, 162, 235, 1)',
                'rgba(85, 85, 85, 1)',
                'rgba(223, 143, 0, 1)'
            ],
            borderWidth: 1
        }]
    },
    options: {
        indexAxis: 'y',
        maintainAspectRatio: false,
        scales: {
            x: {
                ticks: {
                    color: '#000'
                }
            },
            y: {
                ticks: {
                    color: '#000',
                    scaleSize: 200,
                    beginAtZero: true,
                    grace: '10%'
                },
            }
        },
        plugins: {
            legend: {
                display: false
            },
        },
        aspectRatio: 1.75
    }
});





